---
layout: post
title: Virtual Switch System
category: :Layer 2
tag: knowledge
---
VSS, or Virtual Switch System, exists in Cisco Catalyst 6500 and 4500 switches running IOS-XE. VSS simplifies the network by reducing the number of network elements. VSS can combine multiple Catalyst Switches into a single logical device. VSS logically combines a pair of switches into a single network element.

The two switches in the pair negotiate their roles - one will assume the role of the active switch while the other assumes the role of the standby switch. The VSS active switch controls the VSS, running the Layer 2 and Layer 3 protocols for both switches. Both switches perform packet forwarding as needed, but the standby switch sends all control traffic to the VSS active switch for processing.

The virtual switch link (VSL) is the link which ties the active and standby switches together. It is typically implemented as an EtherChannel, and therefore can support up to 8 links in the bundle. The attached devices (such as access switches) can then connect to the VSS using Multichassis EtherChannel. Unlike normal EtherChannel witch connects multiple links between two switches, MultiChassis EtherChannel can connect one switch over multiple links to two switches. In total, a VSS can support up to 256 EtherChannels in a combination of regular EtherChannels and MultiChassis EtherChannels (MEC).

#### Configuration

Both switches in a VSS pair need to belong to the same VSS domain. This domain is a number between 1 and 255. After creating the domain, you must configure one switch to be switch number 1 and the other switch to be switch number 2.
```
`SW1(config)# switch virtual domain 10
SW1(config-vs-domain)# switch 1
```
````
`SW2(config)# switch virtual domain 10
SW2(config-vs-domain)# switch 2
```
`
Next you should create the VSL between the two VSS switches.
```
`SW1(config)# interface port-channel 5
SW1(config-if)# switchport
SW1(config-if)# switch virtual link 1
SW1(config-if)# no shutdown
```
````
`SW2(config)# interface port-channel 10
SW2(config-if)# switchport
SW2(config-if)# switch virtual link 2
SW2(config-if)# no shutdown
```
`
Next, you have to put the physical interfaces into the appropriate port-channels created for the VSL.
```
`SW1(config)# int range gig1/0-3
SW1(config-if-range)# switchport mode trunk
SW1(config-if-range)# channel-group 5 mode on
```
````
`SW1(config)# int range gig1/0-3
SW1(config-if-range)# switchport mode trunk
SW1(config-if-range)# channel-group 10 mode on
```
`
Next, to complete the switch conversion process you need to run the following command on each switch:
```
`SW1# switch convert mode virtual
```
````
`SW2# switch convert mode virtual
```
`
The switch will reload and when they come back up they will now be part of the VSS domain.

Some sample show commands are:
```
`SW1# show switch virtual

SW1# show switch virtual role

SW1# show switch virtual link

SW1# show switch virtual link port-channel
```
`