---
name: 2.5
title: 2.5 - PPPoE
short-title: PPPoE
exam: both
category: Layer 2
collection: Layer2
layout: page
---
PPPoE allows us to establish a PPP link over an Ethernet connection. ISPs were the main ones to use this as it gave them authentication capabilities over Ethernet, in a manner that was familiar to them from their dial-up days. There are two sides to the configuration, both a client and a server. We will start with the server side first.
```
Server(config)# bba-group pope global
Server(config-bba-group)# virtual-template 1
```
The BBA group (Broadband Access) above is only needed if you want to run more than one PPPoE session.
```
Server(config)# interface virtual-template 1
Server(config-if)# ip address 192.168.12.2 255.255.255.0
Server(config-if)# mtu 1492
Server(config-if)# peer default address pool CLIENT
```
Notice we have to reduce the MTU by 8 bytes due to the PPPoe overhead. Next we create the CLIENT IP address pool:
```
Server(config)# ip local pool CLIENT 192.168.12.1
```
Finally, we just need to activate the BBA group on the interface.
```
Server(config)# interface FastEthernet0/0
Server(config-if)# pppoe enable group global
Server(config-if)# exit
```

Now we move on to the Client:

```
Client(config)# interface dialer 1
Client(config-if)# mtu 1492
Client(config-if)# encapsulation ppp
Client(config-if)# ip address negotiated
Client(config-if)# dialer persistent
Client(config-if)# dialer pool 1

Client(config)# interface FastEthernet0/0
Client(config-if)# pppoe-client dial-pool-number 1
Client(config-if)# exit
```
The dialer persistent command nails the connection up.